---
kind: method
id: M:Autodesk.Revit.DB.Form.IsSideFace(Autodesk.Revit.DB.Reference)
zh: 对话框、窗口、窗体
source: html/6232e5d4-43e9-bfdf-8531-08eb62834505.htm
---
# Autodesk.Revit.DB.Form.IsSideFace Method

**中文**: 对话框、窗口、窗体

Given a face, tell if it is a side face.

## Syntax (C#)
```csharp
public bool IsSideFace(
	Reference faceReference
)
```

## Parameters
- **faceReference** (`Autodesk.Revit.DB.Reference`) - The reference of the face to be checked.